/*Зачастую нам надо повторять одно и то же действие во многих частях программы.
Например, необходимо красиво вывести сообщение при приветствии посетителя, при выходе посетителя с сайта, ещё где-нибудь.
Чтобы не повторять один и тот же код во многих местах, придуманы функции. Функции являются основными «строительными блоками» программы.
Примеры встроенных функций – это alert(message), prompt(message, default) и confirm(question). Но можно создавать и свои.
*/
//Объявление функции:
//Для создания функций мы можем использовать объявление функции.
function showMessage() {
    console.log('Всем привет!');
}
/*Вначале идёт ключевое слово function,  после него имя функции, затем список параметров в круглых скобках через запятую  (в примере он пустой)
 и, код функции, также называемый «телом функции», внутри фигурных скобок.
*/
function name(parametr) {
    //body
}

//Наша новая функция может быть вызвана по своему имени: showMessage().
function showMessage() {
    console.log("Hello gues!");
}
showMessage();
showMessage();
//showMessage(console.log("Hello gues!")); ესეც სწორი იქნება
/*Вызов showMessage() выполняет код функции. Здесь мы увидим сообщение дважды. 
 Этот пример явно демонстрирует одно из главных предназначений функций: избавление от дублирования кода.
 Если понадобится поменять сообщение или способ его вывода – достаточно изменить его в одном месте: в функции, которая его выводит.
*/

//Локальные переменные ლოკალური ცვლადები
//Переменные, объявленные внутри функции, видны только внутри этой функции.
function showMessage() {
    let message = 'Привет, я JavaScript!'; //локальная переменная

    //console.log(message);
}

showMessage();
//console.log(message); //message is not defined т.к. переменная видна только внутри функции

//Внешние переменные გარე ცვლადები
//У функции есть доступ к внешним переменным, например:
let user1 = 'Вася';

function showMessage() {
    let message = 'Привет, ' + user1;
    console.log(message);
}

showMessage();
//https://learn.javascript.ru/function-basics

//Функция обладает полным доступом к внешним переменным и может изменять их значение.
let userName = "Vasia";

function showMessage() {
    userName = "Petia"; //(1) изменяем значение внешней переменной

    let message = 'Hi,' + userName;
    console.log(message);
}
console.log(userName); // Вася перед вызовом функции

showMessage();

console.log(userName); //Петя, значение внешней переменной было изменено функцией


/*Внешняя переменная используется, только если внутри функции нет такой локальной. 
Если одноимённая переменная объявляется внутри функции, тогда она перекрывает внешнюю. 
Например, в коде ниже функция использует локальную переменную userName. 
Внешняя будет проигнорирована:
*/

let user = "Vasia";

function showMessage() {
    let userName = "Petia"; // объявляем локальную переменную

    let message = "Privet," + userName; //Petia
    console.log(message);
}

// функция создаст и будет использовать свою собственную локальную переменную userName
showMessage();

alert(userName); //Vasia, не изменилась, функция не трогала внешнюю переменную


//https://code.mu/ru/javascript/book/prime/functions/basis/practicum/# ამ სასიტიდან არის ეს დავალებები
//1.Сделайте функцию, которая параметром будет принимать число и возвращать массив его делителей.
   //нужно:
//принять одно число
//пройтись циклом от 1 до этого числа
//проверить, делится ли число без остатка
//если да → добавить в массив
//Divisors-გამყოფები
function getDivisors(num){
   let result = [];
  
   for(let i = 1; i <= num; i++){
      if(num % 1 === 0){
        result.push(i);
      }
   }
   return result;
}
console.log(getDivisors(8));//[1,2,4,8]
/*შევქმენი getDivisors ფუნქცია და გადავაწოდე პარამეტრი num-ი ანუ num ცვლადი რომელშიც გადაწოდებული არგუმენტის მნიშვნელობა ინახება მასში. შემდეგ შემოვიტანე result ცვლადი და მნიშვნელობად მივაბაინდიგე ცარიელი მასივი რომელში შემდეგში შეინახება არგუმენტის მნიშვნელობები, for ლუპით შევქმენი ციკლი, let i = 1; let-ით შემოვიტანე iცვლადი და მივანიჭე 1 მნიშვნელობა, i <= num სანამ i ანუ 1 ნაკლებია ან უდრის num ანუ არგუმენტად გადაწოდებულ რიცხვზე  i++ მანამ მოხდეს ინკრემეტაცია,
თუ num % 1 === 0 num-იყოფა 1ზე უნაშთოდ,მაშინ result ცვლადში ჩა-push(i)-ება  i-ის მნიშვნელობა. და დააბრუნებს result-ს.*/

//2.Сделайте функцию, которая параметром будет принимать два числа и возвращать массив их общих делителей.
function commonDivisors(a, b){
  let result = []
  for(let i = 1; i <= Math.min(a, b); i++){
    if(a % i === 0 && b % i === 0){
      result.push(i);
    }
  }
  return result;
}
console.log(commonDivisors(6,8));//[1,2]
/*
% ამოწმებს იყოფა თუ არა
&& ორივე პირობა უნდა შესრულდეს
push() ამატებს მასივში
*/
//ფუნქციამ უნდა:
//მიიღოს 2 რიცხვი
//იპოვოს ორივეს საერთო გამყოფები
//დააბრუნოს მასივი

/*6 და 8 საერთო გამყოფები:[1,2]*/

/*ეხლა ვიფიქროთ (ნაბიჯნაბიჯ)*/
//ავიღოთ რიცხვები:a და b
/*უნდა შევამოწმოთ რიცხვები 1-დან მინიმუმამდე ანუ Math.min(a,b)*/
//თითოეულ i-ზე შავამოწმოთ:
/*თუ a % i === 0 და b % i === 0 ეს არის საერთო გამყოფი
  და ჩავამატოთ მასივში
*/
//ავხსნათ 1-დან მინიმუმამდე რატომ უნდა დავიყვანოთ;
//როცა გვინდა ორი რიცხვის საერთო გამყოფები გავიგოთ,ვეძებთ ისეთ რიცხვებს,რომლებიც ორივეზე იყოფიან.
//მაგალითად ავიღოთ 6 და 8 მათგან მინიმუმი არის 6.
/* შეიძლება თუ არა 7 იყოს ორივეს გამყოფი?
 არა, რადგან 7 უკვე 6-ზე დიდია.
 რიცხვი ვერ იქნება 6-ის გამყოფი,თუ თვითონ 6-ზე დიდია
 გარდა 6-ისა,რომლის თავის თავზე იყოფა.
 
 მარტივად რომ ვთქვათ:
 საერთო გამყოფი აუცილებლად უნდა იყოს ორივე რიცხვზე ნაკლები ან ტოლი.
 თუ ორივე რიცხვიდან პატარა არის 6,
 მაშინ საერთო გამყოფი ვერ იქნება 7,8,9..
 ამიტომ ვამოწმებთ მხოლოდ:1,2,3,4,5,6
 
 მაგალითი
 12 და 18
 მინიმუმი არის 12 და ვამოწმებთ მხოლოდ 1-დან 12-მდე
 რადგან 13,14,15...უკვე 12-ზე დიდია და 12-ს ვერ გაყოფს.
 პასუხი იქნება:[1,2,3,6]
*/
//კოდში:
//for (let i = 1; i <= Math.min(a, b); i++)
//Math.min(a, b) ნიშნავს: აიღე ამ ორი რიცხვიდან პატარა რიცხვი

/*ყოველ ამოცანაზე უნდა გავიარო ეს 4 კითხვა:
❓ რას მთხოვს?
❓ მაგალითზე რა გამოდის?
❓ ციკლი მჭირდება?
❓ რა პირობა (if) უნდა?
*/

//3  ამოცანა არ მაქვს დაწერილი.

//4.Сделайте функцию, которая вернет текущий день недели словом.
function todayDay(){
  let day = new Date() .getDay()
  
  if (day === 0){
    console.log("კვირა");
  }else if (day === 1){
    console.log("ორშაბათი");
  }else if (day === 2){
   console.log("სამშაბთი");
  }else if (day === 3){
  console.log("ოთხშაბათი")
  }else if (day === 4){
  console.log("ხუთშაბათი")
  }else if (day === 5){
  console.log("პარასკევი")
  }else if (day === 6){
  console.log("შაბათი")
  }
}
todayDay();
/*let day = new Date() .getDay()
 ეს ხაზი მუშაობს ესე:
 ვქმნით ცვლადს რომელსაც ქვია day, day-ში შევინახავთ რაღაც მნიშვნელობას.
 new Date() ქმნის მიმდინარე თარიღისა და დროის ობიექტს Sat May 09 2026.
 
 .getDay() 
  ეკითხება Date ობიექტს:
  "კვირის რომელი დღეა?"
  და აბრუნებს რიცხვს მაგალითად:6 რადგან შაბათი არის.
  
  საბოლოო ჯამში ნიშნავს რომ;
  1.აიღე დღევანდელი თარიღი 
  2.გაიგე კვირის დღის ნომერი
  3.შეინახე day ცვლადში
 */