//SPLIT()
//გამოიყენება მაშინ,როცა string-ის ნაწილებად დაშლა გინდა.

//მაგალითად:
let text = "apple banana orange";

//თუ გვინდა თითოეული სიტყვა ცალ-ცალკე მივიღოთ:
let result = text.split(" ");

//document.write(result);

//split(" ") ნიშნავს: " " (space)-ის მიხედვით დაყავი ტექსტი

//დავშალოთ სიტყვებად:
let text1 = "hello world";

//document.write(text1.split(" "));

//ასოებად დაშლა;
let word = "hello";

//document.write(word.split(""));

//მძიმის მიხედვით დაშლა
let fruits = "apple,banana,orange";

//document.write(fruits.split(", "));

/*ერთ სტრინგს arr-ად გადააქცევს*/

//ამოცანა1.მოცემულია string: "red blue green"
//split() გამოიყენე და სიტყვები array-ში გადაიყვანე

let str = "red blue green"
//document.write(str.split(" "));

//ამოცანა2. მოცემულია: "hello" და დაშალე ასოებად
let string = "hello";
//document.write(string.split(""));//h,e,l,l,o

//ამოცანა 3. მოცემულია "apple,banana,orange" მძიმის მიხედვით დაყავი.
let str1 = "apple, banana, orange";
//document.write(str1.split(", "));

//ამოცანა4.მოცემულია "2026-05-21" - სიმბოლოს მიხედვით დაშალე
let string1 = "2026-05-21";
//document.write(string1.split("-"));//["2026", "05", "21"]

/*თუ დავწერთ 20260521
 აქ პრობლემა ის არის, რომ string-ში - საერთოდ არ არსებობს.
 ამიტომ split("-") ვერ დაყოფს.
 */
//დასამახსოვრებელი: split("რითი უნდა გაიყოს")
//თუ იმ სიმბოლოს string-ში ვერ იპოვის, დაყოფა არ მოხდება.


//1.შექმენი ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს მისი ციფრების ნამრავლს.
function multiplication(num){
  //რიცხვს ვხდით ტექსტად და ვშლით სათითაოდ
  let mult = String(num).split(" ");
  let product = 0;

} 

/*მაგალითად:

234
2 * 3 * 4 = 24*/

//2.შექმენი ფუნქცია, რომელიც დათვლის რამდენი ციფრია რიცხვში.
/*მაგალითად:

5678*/

//3.შექმენი ფუნქცია, რომელიც რიცხვის ყველა ციფრს ცალ-ცალკე დაბეჭდავს.

/*მაგალითად:

123

1
2
3
*/

//4.შექმენი ფუნქცია, რომელიც იპოვის რიცხვში ყველაზე დიდ ციფრს.
/*მაგალითად:

5831

8*/

//5.შექმენი ფუნქცია, რომელიც იპოვის ყველაზე პატარა ციფრს.

/*მაგალითად:

5831

1*/

//6.შექმენი ფუნქცია, რომელიც მხოლოდ ლუწი ციფრების ჯამს დააბრუნებს.

/*მაგალითად:

123456
2 + 4 + 6 = 12
*/

//7.შექმენი ფუნქცია, რომელიც მხოლოდ კენტი ციფრების ჯამს დააბრუნებს.

/*მაგალითად:

1234567

1 + 3 + 5 + 7 = 16*/

//8.შექმენი ფუნქცია, რომელიც რიცხვს უკუღმა დააბრუნებს.

/*მაგალითად:

1234

4321*/

//9.შექმენი ფუნქცია, რომელიც შეამოწმებს არის თუ არა ყველა ციფრი ერთნაირი.

/*მაგალითად:

1111

true*/

//10.შექმენი ფუნქცია, რომელიც დათვლის რამდენი ლუწი ციფრია რიცხვში.